adriaan-vdb/ESP32-Arcade-System/galagino/galagino.ino
/*
 * Galagino.ino - Galaga arcade for ESP32 and Arduino IDE
 *
 * (c) 2023 Till Harbaum <till@harbaum.org>
 * 
 * Published under GPLv3
 *
 */

// AV
// https://github.com/harbaum/galagino
// commented out leds in this file and commented out entire leds.h file.


// AV add our own program to switch between that and galagino
#define SWITCH_BUTTON_PIN 14
#define NUM_PROGRAMS 3
int currentProgram = 0;  // 0 for Galagino, 1 for 2P Mode, 2 for the Menu System
// Galagino is the fancy arcade emulator
// 2P Mode is our own flappy bird game
// The Menu system will be used to control:
    // Sound On/Off
    // Display Scaling?
    // Controls Explanation

#define FLAPPY_BIRD_SWITCH_BUTTON_PIN 14
bool inMenu = true;  // Start in the menu
#include "flappybird.h"
#define BTN_START_PIN 0  // Example Start button pin (can map to same as P1/P2 - depending if our start button is right or left)
#define BTN_JUMP_P1_PIN 0  // Example Player 1 Jump button pin
#define BTN_JUMP_P2_PIN 0  // Example Player 2 Jump button pin


bool soundOn = true;  // Initial state of sound (true = ON, false = OFF)
#define SOUND_TOGGLE_BUTTON_PIN 0  // Pin for the button to toggle sound



// JT VGA STUFF

#include "VGA.h"
#include <FONT_9x16.h>


#include <esp_now.h>
#include <WiFi.h>

typedef struct struct_message {
    int joystick_x_value = 0;
    int joystick_y_value = 0;
    int joystick_sw_value = 1;
    int button_1_value = 1;
    int button_2_value = 1;
} struct_message;

int second_controller_button = 1;

typedef struct struct_message_raw {
    int joystick_x_value = 0;
    int joystick_y_value = 0;
    int joystick_sw_value = 1;
    int button_1_value = 1;
    int button_2_value = 1;
    int main_controller; // 1 if main controller; 0 if not
} struct_message_raw;

// Create a struct_message called myData
struct_message myData;
struct_message_raw myData_raw;

VGA vga;

int scale = 2;

// Pin numbers for joystick x, y and switch; originally, 1 2 3
const int joystick_x = 18;
const int joystick_y = 17;
const int joystick_sw = 16;

// Pin numbers for buttons; originally 11 10
const int button_1 = 13;
const int button_2 = 12;

// END JT VGA STUFF


#include "config.h"
#include <TFT_eSPI.h>

#include "driver/i2s.h"
#include "video.h"
// #include "leds.h"

#include "emulation.h"

#include "tileaddr.h"

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 5)
// See https://github.com/espressif/arduino-esp32/issues/8467
#define WORKAROUND_I2S_APLL_PROBLEM
// as a workaround we run dkong audio also at 24khz (instead of 11765)
// and fill the buffer at half the rate resulting in 12khz effective
// sample rate
unsigned char dkong_obuf_toggle = 0;
#endif

#define IO_EMULATION

TFT_eSPI tft = TFT_eSPI(170, 320); // Init screen size
TFT_eSprite sprite2 = TFT_eSprite(&tft);  // Define sprite here

// AV to scale image - I think it won't work unless multiple of 2 (8)
float scaleFactor = min(170.0 / 224.0, 320.0 / 288.0);  


// the hardware supports 64 sprites
unsigned char active_sprites = 0;
struct sprite_S *sprite;

// AV
struct sprite_S {
  unsigned char code, color, flags;
  short x, y; 
};

// buffer space for one row of 28 characters
unsigned short *frame_buffer;

#ifdef NUNCHUCK_INPUT
#include "Nunchuck.h"
#endif

// AV Flappy bird 2P
#ifdef ENABLE_FLAPPYBIRD
#include "flappybird.h"
#endif

// include converted rom data
#ifdef ENABLE_PACMAN
#include "pacman.h"
#endif

#ifdef ENABLE_GALAGA
#include "galaga.h"
#endif

#ifdef ENABLE_DKONG
#include "dkong.h"
#endif

#ifdef ENABLE_FROGGER
#include "frogger.h"
#endif

#ifdef ENABLE_DIGDUG
#include "digdug.h"
#endif

#ifdef ENABLE_1942
#include "1942.h"
#endif

#ifndef SINGLE_MACHINE
signed char machine = MCH_MENU;   // start with menu
#endif

// AV uncommented to switch to the TFT_eSPI library for the LilyGo T-Display S3
// instance of main tft driver
// Video tft = Video();

TaskHandle_t emulationtask;

#ifdef ENABLE_GALAGA
// the ship explosion sound is stored as a digi sample.
// All other sounds are generated on the fly via the
// original wave tables
unsigned short snd_boom_cnt = 0;
const signed char *snd_boom_ptr = NULL;
#endif

#ifdef ENABLE_DKONG
unsigned short dkong_sample_cnt[3] = { 0,0,0 };
const signed char *dkong_sample_ptr[3];
#endif

#if defined(ENABLE_FROGGER) || defined(ENABLE_1942)
int ay_period[2][4] = {{0,0,0,0}, {0,0,0,0}};
int ay_volume[2][3] = {{0,0,0}, {0,0,0}};
int ay_enable[2][3] = {{0,0,0}, {0,0,0}};
int audio_cnt[2][4], audio_toggle[2][4] = {{1,1,1,1},{1,1,1,1}};
unsigned long ay_noise_rng[2] = { 1, 1 };
extern unsigned char soundregs[];
#endif

// one method to return to the main menu is to reset
// the entire machine. The main disadvantage is a 
// short noise from the speaker during reset
extern "C" void hw_reset(void);
void hw_reset(void) {
  ESP.restart();
}

#ifndef SINGLE_MACHINE
// convert rgb565 big endian color to greyscale
unsigned short greyscale(unsigned short in) {
  unsigned short r = (in>>3) & 31;
  unsigned short g = ((in<<3) & 0x38) | ((in>>13)&0x07);
  unsigned short b = (in>>8)& 31;
  unsigned short avg = (2*r + g + 2*b)/4;
  
  return (((avg << 13) & 0xe000) |   // g2-g0
          ((avg <<  7) & 0x1f00) |   // b5-b0
          ((avg <<  2) & 0x00f8) |   // r5-r0
          ((avg >>  3) & 0x0007));   // g5-g3
}

// JT VGA STUFF

void OnDataRecv(const uint8_t * mac, const uint8_t *incomingData, int len) {
  memcpy(&myData_raw, incomingData, sizeof(myData_raw));

  if (myData_raw.main_controller) {
    myData.joystick_x_value = myData_raw.joystick_x_value;
    myData.joystick_y_value = myData_raw.joystick_y_value;
    myData.joystick_sw_value = myData_raw.joystick_sw_value;
    myData.button_1_value = myData_raw.button_1_value;
    myData.button_2_value = myData_raw.button_2_value;
  }
  else {
    second_controller_button = myData_raw.button_1_value;
  }
  // Serial.print("Data received: ");
  // Serial.println(myData.joystick_x_value);
  // Serial.println(myData.joystick_y_value);
  // Serial.println(myData.joystick_sw_value);
  // Serial.println(myData.button_1_value);
  // Serial.println(myData.button_2_value);
  // Serial.println();
}

int getHue(int red, int green, int blue) {
    float min = std::min(std::min(red, green), blue);
    float max = std::max(std::max(red, green), blue);

