adriaan-vdb/ESP32-Arcade-System/galagino/galagino.ino
    if (min == max) {
        return 0;  // Grayscale, no hue
    }

    float hue = 0.0f;

    if (max == red) {
        hue = (green - blue) / (max - min);
    } else if (max == green) {
        hue = 2.0f + (blue - red) / (max - min);
    } else {  // max == blue
        hue = 4.0f + (red - green) / (max - min);
    }

    hue = hue * 60.0f;
    if (hue < 0) hue += 360.0f;

    return static_cast<int>(round(hue));
}

// Example function to convert 24-bit RGB to 8-bit color
uint8_t convertTo8BitColor(uint8_t r, uint8_t g, uint8_t b) {
    // This is a simple example. You might need a more sophisticated mapping.
    // For example, you could use a predefined palette.
    return (r & 0xE0) | ((g & 0xE0) >> 3) | (b >> 6);
}

void VGAWrite(uint16_t* frame_buffer, uint32_t width, int y_offset) {
    // Iterate over each pixel in the line
    for (uint32_t i = 0; i < width; i++) {
        uint16_t color = frame_buffer[i];

        // Extract RGB components from 16-bit color
        uint8_t r = (color >> 11) & 0x1F;
        uint8_t g = (color >> 5) & 0x3F;
        uint8_t b = color & 0x1F;
        
        // Scale the RGB components to 8-bit values
        r = (r * 255) / 31;
        g = (g * 255) / 63;
        b = (b * 255) / 31;

        r = (r > 127) ? 1 : 0;
        g = (g > 127) ? 1 : 0;
        b = (b > 127) ? 1 : 0;
        
        

        
        // Convert to 8-bit color (this step depends on your palette)
        // Here, we just return a simple combination for demonstration purposes
        // return ;
// }
        
//         // Extract and scale RGB components from 16-bit color
//         uint8_t r = ((color >> 11) & 0x1F) * 255 / 31; // Extract red component
//         uint8_t g = ((color >> 5) & 0x3F) * 255 / 63;  // Extract green component
//         uint8_t b = (color & 0x1F) * 255 / 31;         // Extract blue component

        // Calculate the x and y positions
        int x = i % 224;  // Assuming the screen width is 224 pixels
        int y = i / 224 + y_offset + 30;

        // Draw the pixel using vga.dot() with the 8-bit color
        vga.dot(x, y, r * 1 + g * 8 + b * 64);
    }
}

uint8_t convertTo3BitColor(uint8_t r, uint8_t g, uint8_t b) {
    // Convert 8-bit RGB values to 1-bit values
    uint8_t r_bit = (r > 127) ? 1 : 0;
    uint8_t g_bit = (g > 127) ? 1 : 0;
    uint8_t b_bit = (b > 127) ? 1 : 0;

    // Combine the bits into a single 3-bit value
    return (r_bit << 2) | (g_bit << 1) | b_bit;
}

// render one of three the menu logos. Only the active one is colorful
// render logo into current buffer starting with line "row" of the logo
void render_logo(short row, const unsigned short *logo, char active) {
  unsigned short marker = logo[0];
  const unsigned short *data = logo+1;

  // current pixel to be drawn
  unsigned short ipix = 0;
    
  // less than 8 rows in image left?
  unsigned short pix2draw = ((row <= 96-8)?(224*8):((96-row)*224));
  
  if(row >= 0) {
    // skip ahead to row
    unsigned short col = 0;
    unsigned short pix = 0;
    while(pix < 224*row) {
      if(data[0] != marker) {
        pix++;
        data++;
      } else {
        pix += data[1]+1;
        col = data[2];
        data += 3;
      }
    }
    
    // draw pixels remaining from previous run
    if(!active) col = greyscale(col);
    while(ipix < ((pix - 224*row < pix2draw)?(pix - 224*row):pix2draw))
      frame_buffer[ipix++] = col;
  } else
    // if row is negative, then skip target pixel
    ipix -= row * 224;
    
  while(ipix < pix2draw) {
    if(data[0] != marker)
      frame_buffer[ipix++] = active?*data++:greyscale(*data++);
    else {
      unsigned short color = data[2];
      if(!active) color = greyscale(color);
      for(unsigned short j=0;j<data[1]+1 && ipix < pix2draw;j++)
        frame_buffer[ipix++] = color;

      data += 3;
    }
  }  
}
#endif

#ifndef SINGLE_MACHINE
// menu for more than three machines
const unsigned short *logos[] = {
#ifdef ENABLE_PACMAN    
  pacman_logo,
#endif
#ifdef ENABLE_GALAGA
  galaga_logo,
#endif
#ifdef ENABLE_DKONG    
  dkong_logo,
#endif
#ifdef ENABLE_FROGGER    
  frogger_logo,
#endif
#ifdef ENABLE_DIGDUG    
  digdug_logo,
#endif
#ifdef ENABLE_1942
  _1942_logo,
#endif
};
#endif

// render one of 36 tile rows (8 x 224 pixel lines)
void render_line(short row) {
  // the upper screen half of frogger has a blue background
  // using 8 in fact adds a tiny fraction of red as well. But that does not hurt
  memset(frame_buffer, 
#ifdef ENABLE_FROGGER 
    (MACHINE_IS_FROGGER && row <= 17)?8:
#endif
    0, 2*224*8);

#ifndef SINGLE_MACHINE
  if(machine == MCH_MENU) {

    if(MACHINES <= 3) {    
      // non-scrolling menu for 2 or 3 machines
      for(char i=0;i<sizeof(logos)/sizeof(unsigned short*);i++) {
      	char offset = i*12;
	      if(sizeof(logos)/sizeof(unsigned short*) == 2) offset += 6;
	
	      if(row >= offset && row < offset+12)  
	        render_logo(8*(row-offset), logos[i], menu_sel == i+1);
      }
    } else {
      // scrolling menu for more than 3 machines
    
      // valid offset values range from 0 to MACHINE*96-1
      static int offset = 0;

      // check which logo would show up in this row. Actually
      // two may show up in the same character row when scrolling
      int logo_idx = ((row + offset/8) / 12)%MACHINES;
      if(logo_idx < 0) logo_idx += MACHINES;
      
      int logo_y = (row * 8 + offset)%96;  // logo line in this row
      
      // check if logo at logo_y shows up in current row
      render_logo(logo_y, logos[logo_idx], (menu_sel-1) == logo_idx);
      
      // check if a second logo may show up here
      if(logo_y > (96-8)) {
        logo_idx = (logo_idx + 1)%MACHINES;
        logo_y -= 96;
        render_logo(logo_y, logos[logo_idx], (menu_sel-1) == logo_idx);
      }
      
      if(row == 35) {
      	// finally offset is bound to game, something like 96*game:    
	      int new_offset = 96*((unsigned)(menu_sel-2)%MACHINES);
	      if(menu_sel == 1) new_offset = (MACHINES-1)*96;
	
