adriaan-vdb/ESP32-Arcade-System/galagino/galagino.ino
#ifdef ENABLE_PACMAN
PACMAN_BEGIN
  pacman_prepare_frame();    
PACMAN_END
#endif

#ifdef ENABLE_GALAGA
GALAGA_BEGIN
  galaga_prepare_frame();
GALAGA_END
#endif  
  
#ifdef ENABLE_DKONG
DKONG_BEGIN
  dkong_prepare_frame();
DKONG_END
#endif

#ifdef ENABLE_FROGGER
FROGGER_BEGIN
  frogger_prepare_frame();
FROGGER_END
#endif

#ifdef ENABLE_DIGDUG
DIGDUG_BEGIN
  digdug_prepare_frame();
DIGDUG_END
#endif

#ifdef ENABLE_1942
_1942_BEGIN
  _1942_prepare_frame();
_1942_END
#endif

  // max possible video rate:
  // 8*224 pixels = 8*224*16 = 28672 bits
  // 2790 char rows per sec at 40Mhz = max 38 fps
#if TFT_SPICLK < 80000000
#define VIDEO_HALF_RATE
#endif

#ifdef VIDEO_HALF_RATE
  // render and transmit screen in two halfs as the display
  // running at 40Mhz can only update every second 60 hz game frame
  for(int half=0;half<2;half++) {
    // Serial.print("Rendering half: ");
    // Serial.println(half);

    // vga.clear(0);

    for(int c=18*half;c<18*(half+1);c+=3) {
      // AV changed write to pushImage

      // JT VGA STuff
      

      // Calculate the vertical offset based on the half being rendered
      // int vertical_offset = (half == 0) ? 0 : (0 / 2);  // Offset for the second half

      render_line(c + 0);
      VGAWrite(frame_buffer, 224 * 8, (c + 0) * 8);  // Adjust vertical position
      
      render_line(c + 1);
      VGAWrite(frame_buffer, 224 * 8, (c + 1) * 8);
      
      render_line(c + 2);
      VGAWrite(frame_buffer, 224 * 8, (c + 2) * 8);
      
      // render_line(c + 0); tft.pushImage(0, c * 8, 224, 8, frame_buffer);
      // render_line(c + 1); tft.pushImage(0, (c + 1) * 8, 224, 8, frame_buffer);
      // render_line(c + 2); tft.pushImage(0, (c + 2) * 8, 224, 8, frame_buffer);

// AV IMPORTANT: shifting screen (scaling isn't working)
      int shiftLeft = 20; // Define the shift amount
      int shiftDown = 20;

      render_line(c + 0); tft.pushImage(-shiftLeft, (c + 0) * 8 + shiftDown, 224, 8, frame_buffer);
      render_line(c + 1); tft.pushImage(-shiftLeft, (c + 1) * 8 + shiftDown, 224, 8, frame_buffer);
      render_line(c + 2); tft.pushImage(-shiftLeft, (c + 2) * 8 + shiftDown, 224, 8, frame_buffer);

      // audio is refilled 6 times per screen update. The screen is updated
      // every second frame. So audio is refilled 12 times per 30 Hz frame.
      // Audio registers are udated by CPU3 two times per 30hz frame.
        // AV commented audio
        //snd_transmit();
    } 
 
    // one screen at 60 Hz is 16.6ms
    unsigned long t1 = (micros()-t0)/1000;  // calculate time in milliseconds
    // printf("uspf %d\n", t1);
    if(t1<(half?33:16)) vTaskDelay((half?33:16)-t1);
    else if(half)       vTaskDelay(1);    // at least 1 ms delay to prevent watchdog timeout

    // physical refresh is 30Hz. So send vblank trigger twice a frame
    // to the emulation. This will make the game run with 60hz speed
    xTaskNotifyGive(emulationtask);
  }
#else
  #warning FULL SPEED
  
  // render and transmit screen at once as the display
  // running at 80Mhz can update at full 60 hz game frame
  for(int c=0;c<36;c+=6) {
    render_line(c + 0);
    VGAWrite(frame_buffer, 224 * 8, (c + 0) * 8);  // Adjust vertical position
    
    render_line(c + 1);
    VGAWrite(frame_buffer, 224 * 8, (c + 1) * 8);
    
    render_line(c + 2);
    VGAWrite(frame_buffer, 224 * 8, (c + 2) * 8);
    // AV
    // render_line(c+0); tft.write(frame_buffer, 224*8);
    // render_line(c+1); tft.write(frame_buffer, 224*8);
    // render_line(c+2); tft.write(frame_buffer, 224*8);
    // render_line(c+3); tft.write(frame_buffer, 224*8);
    // render_line(c+4); tft.write(frame_buffer, 224*8);
    // render_line(c+5); tft.write(frame_buffer, 224*8);
    render_line(c + 0); tft.pushImage(0, (c + 0) * 8, 224, 8, frame_buffer);
    render_line(c + 1); tft.pushImage(0, (c + 1) * 8, 224, 8, frame_buffer);
    render_line(c + 2); tft.pushImage(0, (c + 2) * 8, 224, 8, frame_buffer);
    render_line(c + 3); tft.pushImage(0, (c + 3) * 8, 224, 8, frame_buffer);
    render_line(c + 4); tft.pushImage(0, (c + 4) * 8, 224, 8, frame_buffer);
    render_line(c + 5); tft.pushImage(0, (c + 5) * 8, 224, 8, frame_buffer);

    // audio is updated 6 times per 60 Hz frame
    snd_transmit();
  } 
 
  // one screen at 60 Hz is 16.6ms
  unsigned long t1 = (micros()-t0)/1000;  // calculate time in milliseconds
  if(t1<16) vTaskDelay(16-t1);
  else      vTaskDelay(1);    // at least 1 ms delay to prevent watchdog timeout

  // physical refresh is 60Hz. So send vblank trigger once a frame
  xTaskNotifyGive(emulationtask);
#endif
   
#ifdef ENABLE_GALAGA
  /* the screen is only updated every second frame, scroll speed is thus doubled */
  static const signed char speeds[8] = { -1, -2, -3, 0, 3, 2, 1, 0 };
  stars_scroll_y += 2*speeds[starcontrol & 7];
#endif
}

void emulation_task(void *p) {
  prepare_emulation();

  while(1)
    emulate_frame();
}

void setup() {
  Serial.begin(115200);

  // JT VGA STUFF
  pinMode(joystick_sw, INPUT_PULLUP);
  // digitalWrite(joystick_sw, HIGH); // Random line that must be included
  pinMode(button_1, INPUT_PULLUP);
  pinMode(button_2, INPUT_PULLUP);
  // Initialize button pin
  pinMode(SWITCH_BUTTON_PIN, INPUT_PULLUP);

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);

  int x = 0;
  int y = 0;
  int sw = 0;
  int b1 = 0;
  int b2 = 0;
  
  // AV
  tft.init();  
  tft.fillScreen(TFT_BLACK);
  tft.begin();

  const PinConfig pins(-1,-1,1,-1,-1,  -1,-1,-1,2,-1,-1,  -1,-1,-1,3,-1,  10,11); // R G B h v

	Mode mode = Mode::MODE_640x400x70;
	
  Serial.println(ESP.getFreeHeap());
	if(!vga.init(pins, mode, 8, 3)) while(1) delay(1);
	Serial.println(ESP.getFreeHeap());

	vga.start();

	// for(int y = 0; y < 240; y++)
	// 	for(int x = 0; x < 320; x++)
	// 		vga.dotdit(x, y, x, y, 255-x);

	vga.setFont(FONT_9x16);
	vga.start();
	
	// delay(5000);

  // JT VGA STUFF
  // for(int y = 0; y < 240; y++)
	// 	for(int x = 0; x < 320; x++)
	// 		vga.dot(x, y, x, y, 0);

  Serial.print("ESP-IDF "); 
  Serial.println(ESP_IDF_VERSION, HEX); 

