adriaan-vdb/ESP32-Arcade-System/galagino/galagino.ino
  //Set device as a Wi-Fi Station
  WiFi.mode(WIFI_STA);

  // Init ESP-NOW
  if (esp_now_init() != ESP_OK) {
    Serial.println("Error initializing ESP-NOW");
    return;
  }
  
  // Once ESPNow is successfully Init, we will register for recv CB to
  // get recv packer info
  esp_now_register_recv_cb(OnDataRecv);

  // Initialize the current program
  if (currentProgram == 0) {
    setupGalagino();
  } else if (currentProgram == 1){
    setupFlappyBird2P();
  }
}

void setupGalagino() {

  tft.fillScreen(TFT_BLACK);
  // Stop any running tasks (e.g., emulation task)
  if (emulationtask != NULL) {
    vTaskDelete(emulationtask);  // Delete the previous emulation task if it's running
    emulationtask = NULL;        // Reset task handle
  }

  // Free memory allocated for frame_buffer and sprite if already allocated
  if (frame_buffer != NULL) {
    free(frame_buffer);
    frame_buffer = NULL;
  }
  if (sprite != NULL) {
    free(sprite);
    sprite = NULL;
  }
  machine = MCH_MENU;

  Serial.println("Galagino"); 

  #ifdef WORKAROUND_I2S_APLL_PROBLEM
  Serial.println("I2S APLL workaround active"); 
#endif

  // this should not be needed as the CPU runs by default on 240Mht nowadays
  setCpuFrequencyMhz(240000000);

  Serial.print("Free heap: "); Serial.println(ESP.getFreeHeap());
  Serial.print("Main core: "); Serial.println(xPortGetCoreID());
  Serial.print("Main priority: "); Serial.println(uxTaskPriorityGet(NULL));  

  // allocate memory for a single tile/character row
  frame_buffer = (unsigned short*)malloc(224*8*2);
  sprite = (struct sprite_S*)malloc(128 * sizeof(struct sprite_S));
  Serial.print("Free heap: "); Serial.println(ESP.getFreeHeap());

  // make button pins inputs
  pinMode(BTN_START_PIN, INPUT_PULLUP);
#ifdef BTN_COIN_PIN
  pinMode(BTN_COIN_PIN, INPUT_PULLUP);
#endif

#ifdef NUNCHUCK_INPUT
  nunchuckSetup();
#else
  pinMode(BTN_LEFT_PIN, INPUT_PULLUP);
  pinMode(BTN_RIGHT_PIN, INPUT_PULLUP);
  pinMode(BTN_DOWN_PIN, INPUT_PULLUP);
  pinMode(BTN_UP_PIN, INPUT_PULLUP);
  pinMode(BTN_FIRE_PIN, INPUT_PULLUP);
#endif

  // initialize audio to default bitrate (24khz unless dkong is
  // the only game installed, then audio will directly be 
  // initialized to dkongs 11765hz)

  // AV commented audio
  // audio_init();

// #ifdef LED_PIN
//   leds_init();
// #endif

  // let the cpu emulation run on the second core, so the main core
  // can completely focus on video
  xTaskCreatePinnedToCore(
      emulation_task, /* Function to implement the task */
      "emulation task", /* Name of the task */
      4096,  /* Stack size in words */
      NULL,  /* Task input parameter */
      2,  /* Priority of the task */
      &emulationtask,  /* Task handle. */
      0); /* Core where the task should run */
}

unsigned char buttons_get(void) {
  unsigned char input_states = 0;

  // Read joystick and button states
  // int joystick_x_value = analogRead(joystick_x);
  // int joystick_y_value = analogRead(joystick_y);
  // int joystick_sw_value = digitalRead(joystick_sw);
  // int button_1_value = digitalRead(button_1);
  // int button_2_value = digitalRead(button_2);

  int joystick_x_value = myData.joystick_x_value;
  int joystick_y_value = myData.joystick_y_value;
  int joystick_sw_value = myData.joystick_sw_value;
  int button_1_value = myData.button_1_value;
  int button_2_value = myData.button_2_value;

  int x = 0;
  int y = 0;

  if (joystick_x_value < 1500 || joystick_x_value > 2500 || joystick_y_value < 1500 || joystick_y_value > 2500) {
    float angle = atan2(joystick_y_value-2000,joystick_x_value-2000);
    float pi = 3.14159;
    float num = 2.6;
    if (angle > (num * -1) * pi/12 && angle <= num * pi/12) {
      x = 1;
    }
    else if (angle > num * pi/12 && angle <= (12-num) * pi/12) {
      y = 1;
    }
    else if (angle > (12 - num) * pi/12 || angle <= (num - 12) * pi/12) {
      x = -1;
    }
    else {
      y = -1;
    }
  }

  // Map joystick x/y to left/right/up/down buttons
  input_states |= (x == -1) ? BUTTON_LEFT : 0;
  input_states |= (x == 1) ? BUTTON_RIGHT : 0;
  input_states |= (y == -1) ? BUTTON_UP : 0;
  input_states |= (y == 1) ? BUTTON_DOWN : 0;


  // // Map joystick x/y to left/right/up/down buttons
  // input_states |= (joystick_x_value < 1500) ? BUTTON_LEFT : 0;
  // input_states |= (joystick_x_value > 2500) ? BUTTON_RIGHT : 0;
  // input_states |= (joystick_y_value < 1500) ? BUTTON_UP : 0;
  // input_states |= (joystick_y_value > 2500) ? BUTTON_DOWN : 0;

  // // Map joystick switch to fire button
  // input_states |= (!button_2_value) ? BUTTON_FIRE : 0;

  // Map button_1 to start and coin buttons
  input_states |= (!button_1_value) ? (BUTTON_START) : 0; 
  //   input_states |= (!button_1_value) ? (BUTTON_START | BUTTON_COIN) : 0;

  // Map button_2 to fire button
  input_states |= (!button_2_value) ? (BUTTON_FIRE | BUTTON_COIN) : 0;

  return input_states;
}



// AV removed
// void loop(void) {
//   // run video in main task. This will send signals
//   // to the emulation task in the background to 
//   // synchronize video
//   update_screen(); 

// // #ifdef LED_PIN
// //   leds_update();
// // #endif
// }



// -->>>>>> AV the following is to switch programs between galagino and our own

void runGalagino() {
  // run video in main task. This will send signals
  // to the emulation task in the background to
  // synchronize video
  update_screen();

  // #ifdef LED_PIN
  //   leds_update();
  // #endif
}

void renderFlappyBirdMenu(){

  // // Get the Flappy Bird logo
  // int num_logos = sizeof(logos) / sizeof(unsigned short*);
  // const unsigned short* flappybird_logo = NULL;
  // if (num_logos > 0) {
  //   flappybird_logo = logos[num_logos - 1]; // Assuming it's the last logo
  // } else {
  //   Serial.println("No logos available.");
  //   return;
  // }

  int logoHeight = 10;
  int shiftLeft = 20; // Define the shift amount
  int shiftDown = 20;
  // Render the Flappy Bird logo
  for (short row = 0; row < 96; row += 8) {
    render_logo(row, flappybird_logo, true);
    tft.pushImage(-shiftLeft, row + logoHeight, 224, 8, frame_buffer);
    VGAWrite(frame_buffer, 224 * 8, row);
  }

  // Maybe use code to align everything based on screen dimensions? 
  int initMenuHeight = 120;
  tft.setTextColor(TFT_WHITE);
  vga.setTextColor(73, 0);
  tft.setTextSize(2);
  tft.setCursor(10, initMenuHeight);
  vga.setCursor(40, initMenuHeight + 30);
  tft.println("Press to Jump");
  vga.println("Press to Jump");
  
  tft.setCursor(10, initMenuHeight + 30);
  vga.setCursor(40, initMenuHeight + 30 + 30);
  tft.println("P1: Left Btn");
  vga.println("P1: Left Btn");
  tft.setCursor(10, initMenuHeight + 60);
  vga.setCursor(40, initMenuHeight + 60 + 30);
  tft.println("P2: Right Btn");
  vga.println("P2: Right Btn");
  tft.setTextColor(TFT_GREEN);
  vga.setTextColor(1, 0);
  tft.setTextSize(3);
  tft.setCursor(40, initMenuHeight + 105);
  vga.setCursor(60, initMenuHeight + 105 + 30);
  tft.println("JOYUP");
  vga.println("JOYUP");
  tft.setCursor(40, initMenuHeight + 135);
  vga.setCursor(60, initMenuHeight + 135 + 30);
  tft.println("START");
  vga.println("START");
}

void setupFlappyBird2P() {
  // Stop any running tasks (if any)
  if (emulationtask != NULL) {
    vTaskDelete(emulationtask);  // Delete the previous task
    emulationtask = NULL;        // Reset task handle
  }
  inMenu = true;

