adriaan-vdb/ESP32-Arcade-System/galagino/galagino.ino
  tft.fillScreen(TFT_BLACK);
  vga.fillRect(0, 0, 630, 390, 0);
  pinMode(FLAPPY_BIRD_SWITCH_BUTTON_PIN, INPUT_PULLUP);  // Initialize button pin
  pinMode(BTN_START_PIN, INPUT_PULLUP);  // Start button
  pinMode(BTN_JUMP_P1_PIN, INPUT_PULLUP);  // Player 1 jump button
  pinMode(BTN_JUMP_P2_PIN, INPUT_PULLUP);  // Player 2 jump button
  initFlappyBird2P(); 
}

void runFlappyBird2P() {
  static unsigned long lastDebounceTime = 0;
  static int buttonState = HIGH;  // current debounced button state
  static int lastButtonReading = HIGH;  // previous reading from the input pin

  int reading = myData.joystick_y_value; // FLAPPY_BIRD_SWITCH_BUTTON_PIN (joystick up to start)

  if (reading != lastButtonReading) {
    lastDebounceTime = millis();
  }

  // Debouncing logic
  if ((millis() - lastDebounceTime) > 50) {
    // If the button state has changed
    if (reading != buttonState) {
      buttonState = reading;

      if (buttonState == LOW) { //&& !flappyBirdStarted
        // Button is pressed, toggle between menu and game
        flappyBirdStarted = false;
        inMenu = !inMenu;
        tft.fillScreen(TFT_BLACK);  // Clear screen
        vga.fillRect(0, 0, 630, 390, 0);
      }
    }
  }

  lastButtonReading = reading;

  // Render either the menu or the game depending on the current state
  if (inMenu) {
    flappyBirdStarted = false;
    renderFlappyBirdMenu();  // Show the menu
  } else {
    flappyBirdStarted = true;
    FlappyBird2P();  // Run the game
  }
}

// Button debounce variables for each player
unsigned long lastDebounceTimeP1 = 0;
unsigned long lastDebounceTimeP2 = 0;
unsigned long lastDebounceTimeStart = 0;
unsigned long debounceDelay = 50;

int lastButtonStateP1 = HIGH;
int lastButtonStateP2 = HIGH;
int lastButtonStateStart = HIGH;


void FlappyBird2P(){
  handleInput();
  // Run the main Flappy Bird 2P game logic
  mainFlappyBird2P();
}


// Handle input for both players and the start button
void handleInput() {
  // Player 1 jump (left button)
  if (isButtonPressed(myData.button_1_value, lastDebounceTimeP1, lastButtonStateP1)) {
    birdJump(bird1);  // Player 1's bird jumps
  }

  // Player 2 jump (right button)
  if (isButtonPressed(second_controller_button, lastDebounceTimeP2, lastButtonStateP2)) {
    birdJump(bird2);  // Player 2's bird jumps
  }

  // Start button press to start the game or restart after game over
  if (isButtonPressed(myData.joystick_y_value, lastDebounceTimeStart, lastButtonStateStart)) {
    if (!flappyBirdStarted) {
      startGame();  // Start the game if it hasn't started yet
      flappyBirdStarted = true;
    } else if (gameOver) {
      initFlappyBird2P();  // Restart the game if game over
    }
  }
}

// Function to check if a button was pressed, with debounce logic
bool isButtonPressed(int value, unsigned long &lastDebounceTime, int &lastButtonState) {
  int reading = value;

  if (reading != lastButtonState) {
    lastDebounceTime = millis();
  }

  if ((millis() - lastDebounceTime) > debounceDelay) {
    if (reading == LOW) {  // Button is pressed (active-low)
      lastButtonState = reading;
      return true;
    }
  }

  lastButtonState = reading;
  return false;
}


// // Setup the menu system
// void setupMenuSystem() {
//   pinMode(SOUND_TOGGLE_BUTTON_PIN, INPUT_PULLUP);  // Configure button pin

//   tft.fillScreen(TFT_BLACK);
//   vga.fillRect(0, 0, 630, 390, 0);
//   tft.setTextColor(TFT_WHITE);
//   vga.setTextColor(73, 0);
//   tft.setTextSize(2);
  
//   // Display menu title
//   tft.setCursor(20, 10);
//   vga.setCursor(20, 10 + 30);
//   tft.println("Settings");
//   vga.println("Settings");

//   // Display updated sound state
//   tft.setCursor(10, 40);
//   vga.setCursor(10, 40+30);
//   if (soundOn) {
//     tft.setTextColor(TFT_GREEN);
//     vga.setTextColor(1, 0);
//     tft.println("Sound: ON");
//     vga.println("Sound: ON");
//   } else {
//     tft.setTextColor(TFT_RED);
//     vga.setTextColor(64, 0);
//     tft.println("Sound: OFF");
//     vga.println("Sound: OFF");
//   }

//   tft.setTextColor(TFT_WHITE);
//   vga.setTextColor(73, 0);
//   tft.setCursor(10, 80);
//   vga.setCursor(10, 80+30);
//   tft.println("Press X To");
//   vga.println("Press X To");
//   tft.setCursor(10, 110);
//   vga.setCursor(10, 110+30);
//   tft.println("Toggle Sound");
//   vga.println("Toggle Sound");
// }

// void runMenuSystem() {
//   // Check if the button is pressed (active-low button)
//   if (myData.button_1_value == LOW) {
//     delay(200);  // Simple debounce delay
//     soundOn = !soundOn;  // Toggle the sound state
    
//     // Clear the screen and update the menu with the new sound state
//     tft.fillScreen(TFT_BLACK);
//     vga.fillRect(0, 0, 630, 390, 0);
//     tft.setTextColor(TFT_WHITE);
//     vga.setTextColor(73, 0);
//     tft.setTextSize(2);
    
//     // Display menu title
//     tft.setCursor(20, 10);
//     vga.setCursor(20, 10 + 30);
//     tft.println("Settings");
//     vga.println("Settings");

//     // Display updated sound state
//     tft.setCursor(10, 40);
//     vga.setCursor(10, 40+30);
//     if (soundOn) {
//       tft.setTextColor(TFT_GREEN);
//       vga.setTextColor(1, 0);
//       tft.println("Sound: ON");
//       vga.println("Sound: ON");
//     } else {
//       tft.setTextColor(TFT_RED);
//       vga.setTextColor(64, 0);
//       tft.println("Sound: OFF");
//       vga.println("Sound: OFF");
//     }

//     tft.setTextColor(TFT_WHITE);
//     vga.setTextColor(73, 0);
//     tft.setCursor(10, 80);
//     vga.setCursor(10, 80+30);
//     tft.println("Press X To");
//     vga.println("Press X To");
//     tft.setCursor(10, 110);
//     vga.setCursor(10, 110+30);
//     tft.println("Toggle Sound");
//     vga.println("Toggle Sound");
    
//     // Add delay to avoid bouncing issues
//     delay(500);
//   }
// }

bool vgaOn = true;  // Toggle VGA display for flappy Bird

// Setup the menu system
void setupMenuSystem() {

  // Clear both screens (TFT and VGA)
  tft.fillScreen(TFT_BLACK);
  vga.fillRect(0, 0, 630, 390, 0);
  
