adriaan-vdb/ESP32-Arcade-System/galagino/galagino.ino
  // Set text color for both displays
  tft.setTextColor(TFT_WHITE);
  vga.setTextColor(73, 0);
  tft.setTextSize(2);

  // Display menu title
  tft.setCursor(20, 10);
  vga.setCursor(20, 10 + 30);
  tft.println("Settings");
  vga.println("Settings");

  // Display updated sound state
  tft.setCursor(10, 40);
  vga.setCursor(10, 40 + 30);
  if (soundOn) {
    tft.setTextColor(TFT_GREEN);
    vga.setTextColor(1, 0);
    tft.println("Sound: ON");
    vga.println("Sound: ON");
  } else {
    tft.setTextColor(TFT_RED);
    vga.setTextColor(64, 0);
    tft.println("Sound: OFF");
    vga.println("Sound: OFF");
  }

  // Display VGA state
  tft.setCursor(10, 80);
  vga.setCursor(10, 80 + 30);
  if (vgaOn) {
    tft.setTextColor(TFT_GREEN);
    vga.setTextColor(1, 0);
    tft.println("VGA: ON");
    vga.println("VGA: ON");
  } else {
    tft.setTextColor(TFT_RED);
    vga.setTextColor(64, 0);
    tft.println("VGA: OFF");
    vga.println("VGA: OFF");
  }

  // Instructions for toggling
  tft.setTextColor(TFT_WHITE);
  vga.setTextColor(73, 0);
  tft.setCursor(10, 120);
  vga.setCursor(10, 120 + 30);
  tft.println("B1: Sound");
  vga.println("B1: Sound");
  
  tft.setCursor(10, 180);
  vga.setCursor(10, 180 + 30);
  tft.println("B2: VGA");
  vga.println("B2: VGA");
}

void runMenuSystem() {
  // Check if the sound toggle button is pressed (active-low button)
  if (myData.button_1_value == LOW) {
    delay(200);  // Simple debounce delay
    soundOn = !soundOn;  // Toggle the sound state
    
    // Redraw the menu
    setupMenuSystem();

    // Add delay to avoid bouncing issues
    delay(500);
  }

  // Check if the VGA toggle button is pressed (active-low button)
  if (myData.button_2_value == LOW) {
    delay(200);  // Simple debounce delay
    vgaOn = !vgaOn;  // Toggle the VGA state

    // Redraw the menu
    setupMenuSystem();

    // Add delay to avoid bouncing issues
    delay(500);
  }
}


void loop() {
  static unsigned long lastDebounceTime = 0;
  static int buttonState = HIGH;        // the current debounced button state
  static int lastButtonReading = HIGH;  // the previous reading from the input pin

  // Menu button?
  int reading = myData.joystick_sw_value;

  if (reading != lastButtonReading) {
    lastDebounceTime = millis();
    lastButtonReading = reading;
  }

  if ((millis() - lastDebounceTime) > 50) {
    // If the button state has changed
    if (reading != buttonState) {
      buttonState = reading;

      if (buttonState == LOW) {
        // Button is pressed
        currentProgram = (currentProgram + 1) % NUM_PROGRAMS; // Cycle through 0, 1, 2
        Serial.print("Switched to ");
        // Reinitialize the program
        if (currentProgram == 0) {
          Serial.println("Galagino");
          setupGalagino();
        } else if (currentProgram == 1) {
          Serial.println("Flappy Bird 2P");
          setupFlappyBird2P();
        } else if (currentProgram == 2) {
          Serial.println("Menu System");
          setupMenuSystem();
        }
      }
    }
  }

  // Run the selected program based on the current state
  if (currentProgram == 0) {
    runGalagino();
  } else if (currentProgram == 1) {
    runFlappyBird2P();
  } else if (currentProgram == 2) {
    runMenuSystem();
  }
}


// AV original galagino only code
// void loop(void) {
//   // run video in main task. This will send signals
//   // to the emulation task in the background to
//   // synchronize video
//   update_screen();

// // #ifdef LED_PIN
// //   leds_update();
// // #endif
// }
